package com.example.recipebook;

public class Utils {

    public static final String RECIPE_1_TITLE = "Пирожки с яйцом и зеленым луком";
    public static final String RECIPE_1_DESCRIPTION = "Аппетитные, быстрые, из простых продуктов! Ленивые пирожки с яйцом и зеленым луком не надо лепить — тесто для них готовится заливное, по виду напоминающее тесто для оладий, только немного гуще.";
    public static final String RECIPE_1_RECIPE =
            "\n" +
            "    Шаг 1:\n" +
            "    Как сделать ленивые пирожки с яйцом и зеленым луком? Начните приготовление с начинки. Яйца отварите. Как сварить яйца вкрутую? Положите их в холодную воду, поставьте варить на небольшой огонь. Варите яйца 9 минут после закипания, затем залейте холодной водой и остудите. От резкого перепада температур скорлупа лучше очистится. Очистите их от скорлупы и нарежьте средними кубиками при помощи ножа или ситечка с ячейками. Лук помойте и мелко нарежьте.\n" +
            "\n" +
            "    Шаг 2:\n" +
            "    Приготовьте тесто. Как сделать заливное тесто для пирожков? В глубокую миску вбейте яйцо и всыпьте соль. Хорошо взбейте венчиком или вилкой.\n" +
            "\n" +
            "    Шаг 3:\n" +
            "    Влейте кефир комнатной температуры, всыпьте соду (не гасите ее, так как она погасится кислотой, содержащейся в кефире) и все хорошо перемешайте.\n" +
            "\n" +
            "    Шаг 4:\n" +
            "    Всыпьте заранее просеянную муку или сразу просейте муку в миску через ситечко. Важно просеять муку, чтобы насытить ее кислородом. Тогда выпечка получится воздушной и хорошо поднимется при выпекании. Начните замешивать тесто ложкой или силиконовой лопаточкой. По консистенции оно должно получиться гуще, чем тесто для оладий. Перемешайте до образования однородной массы без комочков.\n" +
            "\n" +
            "    Шаг 5:\n" +
            "    На последнем этапе добавьте в тесто вареные яйца и зеленый лук, перемешайте. Тесто для пирожков готово.\n" +
            "\n" +
            "    Шаг 6:\n" +
            "    Разогрейте на сковороде небольшое количество растительного масла. Ложкой выкладывайте тесто в виде лепешек на небольшом расстоянии друг от друга, поскольку они будут увеличиваться в размере. Жарьте пирожки на небольшом огне по 3-4 минуты с каждой стороны, чтобы они успели пропечься и не были сырыми в середине. Готовые пирожки снимите и жарьте следующие партии. У меня вышло 11 пирожков. Подливайте масло по надобности между партиями.";

    public static final String RECIPE_2_TITLE = "Звездочки новогодние слоеные";
    public static final String RECIPE_2_DESCRIPTION = "Вы будете шокированы! Гости сметают эту закуску махом! Я поставила перед собой задачу придумать новогоднее меню не в ущерб православному Рождественскому Посту.";
    public static final String RECIPE_2_RECIPE =
            "\n" +
            "    Шаг 1:\n" +
            "    Перед началом приготовления обязательно достаньте тесто из холодильника и дайте ему полежать при комнатной температуре, чтобы оно стало не ломким, а пластичным.\n" +
            "\n" +
            "    Шаг 2:\n" +
            "    Очистите и мелко порежьте лук\n" +
            "\n" +
            "    Шаг 3:\n" +
            "    Разогрейте на сковороде растительное масло и обжарьте в нем лук до золотистости (или коричневатого оттенка, если любите послаще)\n" +
            "\n" +
            "    Шаг 4:\n" +
            "    Разомните вилкой рыбу с луком в однородную массу, пригодную для формирования начинки\n" +
            "\n" +
            "    Шаг 5:\n" +
            "    Условно разделите тесто на 2 части\n" +
            "\n" +
            "    Шаг 6:\n" +
            "    Крупной формочкой для печенья НАМЕТЬТЕ места для будущих пирожков, не прорезайте контуры, сейчас вы выясняете, сколько порций начинки вам нужно.\n" +
            "\n" +
            "    Шаг 7:\n" +
            "    Сформируйте шарики начинки по числу звездочек и выложите их в середины намеченых контуров. Смочите водой незадействованную половину теста.\n" +
            "\n" +
            "    Шаг 8:\n" +
            "    Покройте сторону с начинкой свободной стороной, утрамбуйте их так, чтобы тесто склеилось, и вырежьте звездочки из двух слоев с порцией начинки внутри.\n" +
            "\n" +
            "    Шаг 9:\n" +
            "    Удалите обрезки теста. Прищипните звездочки по контуру пальцами. Я пробовала прижимать контур формочкой, как это делается с более толстым самодельным пресным слоеным тестом - магазинное слишком тонкое, оно рвется, видно на фотке готовых изделий.\n" +
            "\n" +
            "    Шаг 10:\n" +
            "    Выпекайте пирожки в духовке согласно инструкции к тесту, но... на 5 минут меньше мин. рек. времени.";

    public static final String RECIPE_3_TITLE = "Шанежки с картошкой шаньги в духовке";
    public static final String RECIPE_3_DESCRIPTION = "Вкусные, ароматные, румяные шанежки с картошкой. Шанежки - открытые пирожки с начинкой. В качестве начинки может быть творог, картофель и даже каша!";
    public static final String RECIPE_3_RECIPE =
            "\n" +
            "    Шаг 1:\n" +
            "    Для начала приготовьте опару. Для этого 100 мл молока нагрейте до тёплого состояния, молоко должно быть именно тёплым, не горячим, это важно, иначе дрожжи погибнут и выпечка не поднимется. К теплому молоку добавьте столовую ложку сахара и столовую ложку муки, перемешайте и поставьте в теплое место на 15 минут.\n" +
            "\n" +
            "    Шаг 2:\n" +
            "    Яица разбейте в миску, добавьте столовую ложку сахара, немного взбейте венчиком, добавьте оставшиеся 100 мл молока, перемешайте, все ингредиенты должны быть комнатной температуры.\n" +
            "\n" +
            "    Шаг 3:\n" +
            "    Муку просейте в миску (просеевание обогатит муку кислородом и выпечка получится пышнее), сделайте в ней углубление, налейте в него яичномолочную смесь, подошедшую опару и растопленное и остуженное до комнатной температуры сливочное масло. Перемешайте венчиком, начиная понемногу захватывать муку с краёв, замесите тесто, накройте его полотенцем и отправьте в теплое место на час.\n" +
            "\n" +
            "    Шаг 4:\n" +
            "    По истечении часа, тесто должно увеличиться в размере.\n" +
            "\n" +
            "    Шаг 5:\n" +
            "    Столешницу присыпьте мукой, выложите на нее подошедшие тесто, обомните.\n" +
            "\n" +
            "    Шаг 6:\n" +
            "    Разделите тесто на 12 частей.\n" +
            "\n" +
            "    Шаг 7:\n" +
            "    Для начинки отварите картофель до готовности.\n" +
            "\n" +
            "    Шаг 8:\n" +
            "    Разомните его и добавьте соль, сливочное масло, сметану, перемешайте.\n" +
            "\n" +
            "    Шаг 9:\n" +
            "    Возьмите одну часть теста, раскатайте в лепешку, при помощи стакана сделайте небольшое углубление и положите в него начинку.\n" +
            "\n" +
            "    Шаг 10:\n" +
            "    Таким образом сформируйте 12 шанежек, выложите их на противень, застеленный пергаментной бумагой на расстоянии друг от друга, так как в процессе выпекания они увеличатся в размере. Поставьте на расстойку в теплое место.\n" +
            "\n" +
            "    Шаг 11:\n" +
            "    Затем разбейте яицо, отделите желток, немного взболтайте его и смажьте шанежки, чтобы они получились румяными. Выпекайте в заранее разогретой до 180 градусов духовке около 20 минут до зарумянивания. Времени может потребоваться чуть больше или меньше ориентируйтесь по своей духовке. Я пекла 20 минут. Шанежки готовы, приятного аппетита!";

    public static final String RECIPE_4_TITLE = "Блины с мясным фаршем";
    public static final String RECIPE_4_DESCRIPTION = "Бесподобно вкусно, из простых продуктов, семье на завтрак! Фаршированные блины - сами по себе отличное дополнение для любого стола, включая праздничный. А с фаршем они получаются еще более вкусными.";
    public static final String RECIPE_4_RECIPE =
            "\n" +
            "    Шаг 1:\n" +
            "    Как сделать блины с фаршем? Подготовьте необходимые ингредиенты. Для блинов все продукты должны быть комнатной температуры. Яйца можно использовать категории С0 или С1. Муку можете брать высшего или первого сорта. Для начинки у меня свинина. Но можно приготовить фарш из любого вида мяса. Если мясо и морозилки, то его необходимо предварительно разморозить при комнатной температуре или в микроволновой печи, в режиме разморозки.\n" +
            "\n" +
            "    Шаг 2:\n" +
            "    Для приготовления блинного теста соедините в глубокой чаше яйца с сахаром. Затем влейте немного растительного масла и молоко. Все смешайте с помощью венчика.\n" +
            "\n" +
            "    Шаг 3:\n" +
            "    Затем добавьте в тесто просеянную муку и соду. Все ингредиенты хорошо перемешайте, чтобы тесто стало однородное, без комочков муки. Для этого можно воспользоваться миксером. Блинное тесто должно получиться жидкое. Консистенцию теста смотрите сами. Возможно придется добавить чуть больше или меньше муки.\n" +
            "\n" +
            "    Шаг 4:\n" +
            "    На блинной сковороде напеките блины. Перед первым блином сковороду немного смажьте растительным маслом. Тесто наливайте на горячую сковороду и распределите его по всей поверхности тонким слоем.\n" +
            "\n" +
            "    Шаг 5:\n" +
            "    Готовые блинчики складывайте на большую тарелку и накрывайте крышкой. Зачем накрывать крышкой? Это необходимо для того, чтобы блинчики не подсыхали.\n" +
            "\n" +
            "    Шаг 6:\n" +
            "    Для приготовления начинки свинину нарежьте на кусочки и пропустите через мясорубку.\n" +
            "\n" +
            "    Шаг 7:\n" +
            "    Сковороду разогрейте до горячего состояния, налейте немного растительного масла и выложите подготовленный фарш. Обжаривайте фарш в течение 3-5 минут.\n" +
            "\n" +
            "    Шаг 8:\n" +
            "    Лук очистите от шелухи, ополосните в прохладной воде и мелко нарежьте. Затем добавьте нарезанный лук в сковороду к фаршу. Все хорошо перемешайте, сделайте огонь немного меньше и обжаривайте все вместе еще минут 15, периодически помешивая.\n" +
            "\n" +
            "    Шаг 9:\n" +
            "    Готовый фарш станет немного золотистого цвета, с приятным ароматом жареного мяса. По вкусу добавьте в него немного соли и специи. Готовую начинку немного остудите.\n" +
            "\n" +
            "    Шаг 10:\n" +
            "    На одну сторону готового блинчика выкладывайте 1-2 столовых ложки мясной начинки.\n" +
            "\n" +
            "    Шаг 11:\n" +
            "    Подверните блинчик по краям и сверните рулетом. Таким образом наполните все блинчики мясной начинкой.\n" +
            "\n" +
            "    Шаг 12:\n" +
            "    Сразу же подавайте к столу, пока горячие. Приятного аппетита!";

    public static final String RECIPE_5_TITLE = "Оладьи на йогурте";
    public static final String RECIPE_5_DESCRIPTION = "Быстрые в приготовлении и невероятно пышные оладьи! Оладьи на йогурте - это еще один рецепт быстрых и вкусных завтраков. В его составе доступные и недорогие ингредиенты.";
    public static final String RECIPE_5_RECIPE =
            "\n" +
            "    Шаг 1:\n" +
            "    Подготовить и отмерить все продукты. Муку лучше просеять, так оладьи будут еще пышнее.\n" +
            "\n" +
            "    Шаг 2:\n" +
            "    Йогурт вылить в миску, добавить яйцо, соль, сахар и соду.\n" +
            "\n" +
            "    Шаг 3:\n" +
            "    Хорошенько перемешать венчиком.\n" +
            "\n" +
            "    Шаг 4:\n" +
            "    Всыпать частями муку, интенсивно размешивая тесто венчиком, чтобы не было комочков.\n" +
            "\n" +
            "    Шаг 5:\n" +
            "    Муки может уйти меньше или больше, надо ориентироваться по тесту. Оно должно стать густым и стекать с ложки медленно.\n" +
            "\n" +
            "    Шаг 6:\n" +
            "    Сковороду смазать растительным маслом совсем немного. Я всегда смазываю только перед первой порцией, но вы смотрите по своей сковороде. Выкладывать тесто ложкой, формируя оладьи примерно одинаковые по размеру.\n" +
            "\n" +
            "    Шаг 7:\n" +
            "    Жарить с каждой стороны по две-три минуты до золотистой корочки.";

    public static final String RECIPE_6_TITLE = "Кабачковые котлеты";
    public static final String RECIPE_6_DESCRIPTION = "Вегетарианские котлеты без единого яйца. Это именно те котлеты, которые можно есть в неограниченном количестве, не боясь за фигуру. Подойдут и постящимся, и веганам, и просто людям, следящим за состоянием своего здоровья.";
    public static final String RECIPE_6_RECIPE =
            "\n" +
            "    Шаг 1:\n" +
            "    Кабачок вымойте и специальным ножом снимите шкурку. Если у вас молодые кабачки, шаг №1 и №2 можно смело пропустить.\n" +
            "\n" +
            "    Шаг 2:\n" +
            "    Далее слегка надрежьте часть мякоти с семенами по периметру и с помощью чайной ложки удалите её. Она не понадобится.\n" +
            "\n" +
            "    Шаг 3:\n" +
            "    Очищенный кабачок натрите на крупной тёрке. Посолите и перемешайте. Если у вас есть кухонный комбайн - это значительно ускорит процесс измельчения.\n" +
            "\n" +
            "    Шаг 4:\n" +
            "    При взаимодействии с солью начнётся процесс отделения жидкости из кабачка. От неё нужно избавиться. Поэтому натёртый кабачок переложите в дуршлаг.\n" +
            "\n" +
            "    Шаг 5:\n" +
            "    Сверху предлагаю поставить гнёт, то есть что-то тяжёлое. Так влага будет стекать быстрее и качественнее. Кабачки отставьте на пятнадцать минут. По прошествии этого времени кабачки ещё можно дополнительно поджать руками или отжать через несколько слоёв марли.\n" +
            "\n" +
            "    Шаг 6:\n" +
            "    Вот сколько сока отдали мои кабачки после пятнадцати минут под гнётом. Этот сок не понадобится.\n" +
            "\n" +
            "    Шаг 7:\n" +
            "    К кабачкам добавьте натёртый на мелкой тёрке зубчик чеснока. И следом половину указанного количества манной крупы. Перемешайте. Далее понемногу вводите столько манки, чтобы консистенция стала удобной для формирования котлеток. Оставьте массу на десять минут, чтобы манная крупа немного набухла.\n" +
            "\n" +
            "    Шаг 8:\n" +
            "    Сформируйте небольшие котлетки и выложите их на антипригарный коврик для выпечки. Запекайте в предварительно разогретом до двухсот градусов духовом шкафу до образования золотистой корочки около тридцати минут. В процессе приготовления переверните котлеты, чтобы они поджарились с двух сторон.";

    public static final String RECIPE_7_TITLE = "Котлеты из куриной грудки";
    public static final String RECIPE_7_DESCRIPTION = "Куриные котлетки в панировке - сочные и сытные. Блюдо готовится быстро и просто, можно подавать на обед с гарниром или на ужин с овощами. Котлеты получаются невероятно нежными и вкусными.";
    public static final String RECIPE_7_RECIPE =
            "\n" +
            "    Шаг 1:\n" +
            "    Для рецепта я использовала одно куриное филе, которое вырезала из половины куриной грудки. Оно получилось весом 300 грамм. Нарезаем куриное мясо кусочками, чистим и режем на 4 части лук. Выкладываем все в чашу блендера и измельчаем. Чем мельче масса, тем сочнее будут котлеты. Можно купить готовый фарш из куриных грудок.\n" +
            "\n" +
            "    Шаг 2:\n" +
            "    Перекладываем измельченное мясо с луком в миску, вбиваем яйцо, добавляем сметану, манку, измельченный чеснок, специи и соль. Специи я использовала \"для котлет\". Вместо свежего чеснока можно взять чесночный порошок. Сметану я брала жирностью 20% - меньшей жирности брать не стоит, так как фарш может получиться жидковатым. В некоторых случаях сметану можно заменить на майонез средней жирности.\n" +
            "\n" +
            "    Шаг 3:\n" +
            "    Перемешиваем содержимое вилкой или ложкой. Пробуем на соль кончиком языка и если что регулируем по вкусу. Фарш готов. Оставляем фарш настояться в холодильнике на 15 минут. За это время манка разбухнет и фарш немного загустеет. Через указанное время достаем фарш из холодильника и еще раз хорошо перемешиваем.\n" +
            "\n" +
            "    Шаг 4:\n" +
            "    Мокрыми руками берем по большой жменьке фарша, разминаем на ладошке его в лепешку, кладем в середину кусочек сливочного масла и измельченный свежий укроп (по желанию), защипываем края и формируем котлеты круглой или продолговатой формы. Из указанного количества фарша у меня вышло 5 средних по размеру котлет. Обильно обваливаем котлеты в панировочных сухарях.\n" +
            "\n" +
            "    Шаг 5:\n" +
            "    Наливаем на сковороду растительное масло, прогреваем его и выкладываем котлеты. Жарим с одной стороны на медленном огне 5-7 минут. Переворачиваем котлеты на другую сторону и жарим такое же время. Куриное мясо готовится быстро, так что за 10-15 минут котлеты полностью приготовятся. Жарим все заготовки.";

    public static final String RECIPE_8_TITLE = "Запеканка из гречки с фаршем";
    public static final String RECIPE_8_DESCRIPTION = "Вкусная и сочная запеканка из обычной гречки. Для этого блюда можно отварить свежую гречку или использовать гречневую кашу, которая у вас застоялась в холодильнике.";
    public static final String RECIPE_8_RECIPE =
            "\n" +
            "    Шаг 1:\n" +
            "    Ставим вариться гречку. Для этого наливаем в кастрюлю 400 миллилитров холодной воды и всыпаем в нее промытую гречку. Солим по вкусу и варим после закипания на медленном огне 10-15 минут. Затем огонь выключаем и даем настояться гречке под закрытой крышкой еще 10 минут. Пересыпаем гречку в миску для остывания.\n" +
            "\n" +
            "    Шаг 2:\n" +
            "    Подготовим овощи для зажарки в начинку. Морковь очищаем и трем на крупной терке. Лук чистим и мелко нарезаем. Перец моем, удаляем плодоножку и семена и нарезаем мелкими кубиками. Перец можно взять не только зеленый, но еще желтый или красный, а также смешать перец разных цветов.\n" +
            "\n" +
            "    Шаг 3:\n" +
            "    Разогреваем на сковороде растительное масло, одновременно выкладываем фарш и подготовленные для зажарки овощи. Добавляем соль, все хорошо перемешиваем и тушим на среднем огне 10 минут при помешивании. Зажарку готовим параллельно с гречкой.\n" +
            "\n" +
            "    Шаг 4:\n" +
            "    Остывшую гречку пересыпаем в большую миску и всыпаем в нее зажарку из фарша и овощей. Все хорошо перемешиваем.\n" +
            "\n" +
            "    Шаг 5:\n" +
            "    Выкладываем гречку в форму для запекания. У меня прямоугольная форма размером 24 на 14 сантиметров. Как раз вышло до краев.\n" +
            "\n" +
            "    Шаг 6:\n" +
            "    Подготовим заливку. Для этого вбиваем в миску яйца, солим их и хорошо взбиваем венчиком, затем вливаем молоко, и еще раз тщательно перемешиваем.\n" +
            "\n" +
            "    Шаг 7:\n" +
            "    Аккуратно и равномерно заливаем гречку яично-молочной смесью. Потом дополнительно можно подравнять поверхность деревянной лопаточкой, чтобы она вышла максимально ровной.\n" +
            "\n" +
            "    Шаг 8:\n" +
            "    Ставим форму в духовку на 25-30 минут при температуре 200 градусов. За 5 минут до окончания готовки посыпаем запеканку натертым сыром. Вынимаем блюдо из духовки и перед нарезанием на порции даем немного остыть, так как в холодном виде запеканка режется лучше и не крошится.";

    public static final String RECIPE_9_TITLE = "Творожная запеканка";
    public static final String RECIPE_9_DESCRIPTION = "Лучший завтрак для ребенка - очень вкусно и просто! Творожная запеканка с манкой и сметаной получается очень нежной и сочной. И ароматной - за счет добавления фруктовой начинки.";
    public static final String RECIPE_9_RECIPE =
            "\n" +
            "    Шаг 1:\n" +
            "    Как сделать творожную запеканку с манкой и сметаной? подготовьте для этого все необходимое. Творог используйте мягкий и влажный. Для более однородной консистенции можете протереть творог через сито. Сметана подойдет любой жирности. Из наполнителей у меня вишня, вы можете использовать любые ягоды, фрукты, сухофрукты, орехи, цукаты.\n" +
            "\n" +
            "    Шаг 2:\n" +
            "    Яйца вымойте и обсушите салфетками. В чаше соедините 2 яйца с сахаром и немного их взбейте. Затем влейте в чашу растопленное сливочное масло.\n" +
            "\n" +
            "    Шаг 3:\n" +
            "    Добавьте в чашу сметану. Жирность сметану не имеет большого значения. Чем она будет выше, тем сливочнее будет вкус. У меня жирность сметаны 15 %.\n" +
            "\n" +
            "    Шаг 4:\n" +
            "    Следом добавьте в чашу подготовленный творог.\n" +
            "\n" +
            "    Шаг 5:\n" +
            "    Добавьте щепотку соли и манную крупу. Все перемешайте. Для этого можно воспользоваться миксером. Он сделает консистенцию творожного теста более однородной. Готовое творожное тесто не жидкое и не сильно густое. От венчика остаются уверенные следы.\n" +
            "\n" +
            "    Шаг 6:\n" +
            "    Для запекания берите любую жаропрочную форму для выпечки. Дно и бока формы смажьте небольшим количеством растительного масла. Выложите в форму творожное тесто и разравняйте его. По всему тесту выложите ягоды сушеной вишни. Вместо вишен можно использовать изюм, курагу, малину и пр. Поставьте запеканку в духовку, разогретую до 170 градусов на 30 минут. Точное время и температуру запекания определяйте по своей духовке.\n" +
            "\n" +
            "    Шаг 7:\n" +
            "    Отдельно приготовьте сметанную заливку. Смешайте сметану, яйцо, сахар и крахмал до однородности.\n" +
            "\n" +
            "    Шаг 8:\n" +
            "    Запеканка перестанет быть жидкой и станет держать форму. Извлеките её из духовки и залейте подготовленной сметанной заливкой. Верните запеканку в духовку еще на 20 минут. Опять же - ориентируйтесь по своей духовке.\n" +
            "\n" +
            "    Шаг 9:\n" +
            "    За время запекания сметанная заливка немного подрумянится по бокам, а её центр будет немного подрагивать. Извлеките форму из духовки и немного остудите.\n" +
            "\n" +
            "    Шаг 10:\n" +
            "    Творожную запеканку нарежьте на порционные кусочки, разложите по тарелкам и подавайте к столу. Приятного аппетита!";

    public static final String RECIPE_10_TITLE = "Запеканка из макарон";
    public static final String RECIPE_10_DESCRIPTION = "Вкусное и быстрое в приготовлении блюдо из макарон и фарша! Макароны с фаршем, на первый взгляд, кажется, так банально. Но, на самом деле, из этих продуктов можно приготовить вкуснейшее блюдо итальянской кухни!";
    public static final String RECIPE_10_RECIPE =
            "    Шаг 1:\n"+
            "    Приготовим ингредиенты по списку. Макароны можно использовать любые по вкусу и наличию, лучше из твердых сортов пшеницы. В кастрюлю наливаем воду, ставим на огонь. Добавляем немного соли. Когда вода закипит, засыпаем в кастрюлю макароны, сразу перемешиваем их ложкой, чтобы они не прилипли к дну кастрюли. Убавляем огонь до среднего и варим в течение 8 минут.\n" +
            "\n" +
            "    Шаг 2:\n" +
            "    Фарш для запеканки также можно использовать любой по вкусу. С куриным фаршем запеканка получится менее калорийной, а со смешанным из свинины и говядины получится жирнее и вкуснее. Фарш используем готовый или самостоятельно крутим на мясорубке из свежего мяса.\n" +
            "\n" +
            "    Шаг 3:\n" +
            "    Репчатый лук чистим от шелухи и мелко рубим ножом.\n" +
            "\n" +
            "    Шаг 4:\n" +
            "    Морковь моем, чистим и натираем на средней терке.\n" +
            "\n" +
            "    Шаг 5:\n" +
            "    На сковороду с толстым дном наливаем растительное масло. Разогреваем его. На масло кладем приготовленные морковь и репчатый лук. Обжариваем овощи на среднем огне до легкой румяности, периодически перемешивая лопаткой.\n" +
            "\n" +
            "    Шаг 6:\n" +
            "    К овощной зажарке отправляем на сковороду фарш, сразу перемешиваем его с овощами, чтобы он не схватился большими комочками. Добавляем соль и черный молотый перец по вкусу. Перемешиваем и жарим около 10 минут на среднем огне.\n" +
            "\n" +
            "    Шаг 7:\n" +
            "    Форму для запекания смазываем сливочным маслом. Выкладываем в форму часть макарон.\n" +
            "\n" +
            "    Шаг 8:\n" +
            "    Сверху выкладываем фарш с овощами.\n" +
            "\n" +
            "    Шаг 9:\n" +
            "    Обжаренные овощи с фаршем закрываем остатками макарон. Сверху присыпаем тертым на мелкой терке твердым сыром. Сорт сыра выбираем по вкусу, главное, чтобы он был с не сильно выраженным специфическим вкусом, чтобы не заглушить вкус других ингредиентов блюда.\n" +
            "\n" +
            "    Шаг 10:\n" +
            "    Ставим запеканку в духовку, разогретую до 180 градусов, на 20 минут. Все ингредиенты – основа запеканки – уже готовы, поэтому ее не нужно долго держать в духовке, чтобы не пересушить. Запеканка из макарон с фаршем и сыром готова. Даем блюду немного остыть и подаем ее к столу со свежими овощами, зеленью или салатом из свежих овощей. Приятного аппетита!";
}
